----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1          [-1, 8, 200, 200]              80
       BatchNorm2d-2          [-1, 8, 200, 200]              16
         MaxPool2d-3          [-1, 8, 100, 100]               0
            Conv2d-4         [-1, 16, 100, 100]           1,168
       BatchNorm2d-5         [-1, 16, 100, 100]              32
         MaxPool2d-6           [-1, 16, 50, 50]               0
            Conv2d-7           [-1, 32, 25, 25]           4,640
       BatchNorm2d-8           [-1, 32, 25, 25]              64
              ReLU-9           [-1, 32, 25, 25]               0
           Conv2d-10           [-1, 32, 25, 25]           9,248
      BatchNorm2d-11           [-1, 32, 25, 25]              64
           Conv2d-12           [-1, 32, 25, 25]             544
      BatchNorm2d-13           [-1, 32, 25, 25]              64
             ReLU-14           [-1, 32, 25, 25]               0
 convolutionBlock-15           [-1, 32, 25, 25]               0
           Conv2d-16           [-1, 64, 13, 13]          18,496
      BatchNorm2d-17           [-1, 64, 13, 13]             128
             ReLU-18           [-1, 64, 13, 13]               0
           Conv2d-19           [-1, 64, 13, 13]          36,928
      BatchNorm2d-20           [-1, 64, 13, 13]             128
           Conv2d-21           [-1, 64, 13, 13]           2,112
      BatchNorm2d-22           [-1, 64, 13, 13]             128
             ReLU-23           [-1, 64, 13, 13]               0
 convolutionBlock-24           [-1, 64, 13, 13]               0
           Conv2d-25            [-1, 128, 7, 7]          73,856
      BatchNorm2d-26            [-1, 128, 7, 7]             256
             ReLU-27            [-1, 128, 7, 7]               0
           Conv2d-28            [-1, 128, 7, 7]         147,584
      BatchNorm2d-29            [-1, 128, 7, 7]             256
           Conv2d-30            [-1, 128, 7, 7]           8,320
      BatchNorm2d-31            [-1, 128, 7, 7]             256
             ReLU-32            [-1, 128, 7, 7]               0
 convolutionBlock-33            [-1, 128, 7, 7]               0
           Conv2d-34            [-1, 256, 4, 4]         295,168
      BatchNorm2d-35            [-1, 256, 4, 4]             512
             ReLU-36            [-1, 256, 4, 4]               0
           Conv2d-37            [-1, 256, 4, 4]         590,080
      BatchNorm2d-38            [-1, 256, 4, 4]             512
           Conv2d-39            [-1, 256, 4, 4]          33,024
      BatchNorm2d-40            [-1, 256, 4, 4]             512
             ReLU-41            [-1, 256, 4, 4]               0
 convolutionBlock-42            [-1, 256, 4, 4]               0
           Conv2d-43            [-1, 256, 4, 4]          65,792
           Conv2d-44            [-1, 256, 7, 7]          33,024
           Conv2d-45          [-1, 256, 13, 13]          16,640
           Conv2d-46          [-1, 256, 25, 25]           8,448
AdaptiveAvgPool2d-47            [-1, 256, 1, 1]               0
AdaptiveAvgPool2d-48            [-1, 256, 1, 1]               0
          Flatten-49                  [-1, 256]               0
           Linear-50                    [-1, 1]             257
          Sigmoid-51                    [-1, 1]               0
          Flatten-52                  [-1, 256]               0
           Linear-53                    [-1, 5]           1,285
          Sigmoid-54                    [-1, 5]               0
================================================================
Total params: 1,349,622
Trainable params: 1,349,622
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.15
Forward/backward pass size (MB): 12.75
Params size (MB): 5.15
Estimated Total Size (MB): 18.05
----------------------------------------------------------------